import type { IAbortSignal } from '../abort-signal';

export type TeardownCallback = () => void;

export interface ISubscriber<T> {
  /** Свойство указывающее на то может ли подписка отправлять новые значения наблюдателю */
  readonly active: boolean;

  /**
   * Сигнал подписки - находится в состоянии aborted, если подписка по какой-либо причине
   * прекратила генерировать новые значения. Если подписка активна, сигнал pending
   */
  readonly signal: IAbortSignal;

  /**
   * Вызывается, когда подписчик выполнится успешно или завершится с ошибкой.
   * Или когда все подписчики отписались от подписки. Используется для того чтоб освободить
   * задействованные ресурсы: таймеры, подписки и т.д.
   */
  addTeardown(callback: TeardownCallback): void;

  /**
   * Передаёт значение переданное в этот метод наблюдателю. Если подписчик более не активен,
   * значения отправленные в этот метод, игнорируются.
   * @param value - значение которое нужно сообщить наблюдателям
   */
  next(value: T): void;

  /**
   * Завершает подписку и сообщает наблюдателю что поток выполнился успешно.
   * Если поток уже завершен, вызов этого метода ни на что не влияет.
   * Последующие после вызова этого метода вызовы next учитываться не будут.
   */
  complete(): void;

  /**
   * Завершает подписку и сообщает наблюдателю что поток завершился с ошибкой.
   * Если поток уже завершен, вызов этого метода ни на что не влияет.
   * Последующие после вызова этого метода вызовы next учитываться не будут.
   */
  error(error?: unknown): void;
}

export type IObserverObject<T> = {
  /**
   * Функция, которая вызывается каждый раз когда Observable генерирует новое значение
   * @param value - значение, которое сгенерировалось в observable
   */
  next?: (value: T) => void;

  /**
   * Функция, которая вызывается, когда Observable завершается с ошибкой
   * @param error - ошибка, которая возникла в Observable
   */
  error?: (error?: unknown) => void;

  /** Функция, которая вызывается, когда Observable завершается успешно */
  complete?: () => void;
};

export interface IObserverFunction<T> {
  (value: T): void;
}

export type IObserver<T> = IObserverObject<T> | IObserverFunction<T>;

export type ObserveOptions = {
  /**
   * Сигнал, при переходе которого в состояние aborted,
   * генерация новых значений в подписке должна прекратиться
   */
  signal?: IAbortSignal;
};
