import { describe, it } from 'vitest';

describe('AbortSignal.any', () => {
  it.todo(
    'Если хотя бы один из сигналов-источников в состоянии aborted, возвращает сигнал в состоянии aborted'
  );

  it.todo('Если список сигналов-источников пуст, возвращает сигнал в состоянии pending');

  it.todo('Возвращает сигнал в состоянии pending, если все переданные сигналы в состоянии pending');

  it.todo(
    'Возвращает сигнал, который переходит в состояние aborted, если хотя бы один из переданных сигналов перейдёт в это состояние'
  );

  it.todo(
    'Причиной перехода в состояние aborted, является причина сигнала который стал триггером к переходу'
  );

  it.todo('Повторный переход сигналов-источников не приводит к вызову события abort');
});
